; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 185679 1 2 2 6 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Star6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon9 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
3. (turn_to satellite0 star1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star1)
   goals met: 0 of 5
4. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
6. (take_image satellite0 star7 instrument1 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 1 of 5
7. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
8. (take_image satellite0 star6 instrument1 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 2 of 5
9. (turn_to satellite0 phenomenon9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 5
10. (take_image satellite0 phenomenon9 instrument1 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 3 of 5
11. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 5
12. (take_image satellite0 phenomenon8 instrument1 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 4 of 5
13. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 5
